Tekla Open API Reference for Tekla Structures 2025
Point.CompareTo Method
 Compares two points. To use binarysearch somekind of sorting should be used.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int CompareTo(
	Object obj
)
Public Function CompareTo (
	obj As Object
) As Integer
Parameters
obj
Type: System.Object
The point to be compared.
Return Value
Type: Int32
0 if both are equal, -1 if this point is before, 1 if this point is after.
Implements
IComparable.CompareTo(Object)
See Also
Reference
Point Class
Tekla.Structures.Geometry3d Namespace